app/controllers/chefs_controller.rb

  def show
    @chef = Chef.find(params[:id])
---
SELECT * FROM "chefs" WHERE ("chefs"."id" = 20)