app/controllers/guest_chefs_controller.rb

  def create

#    return render :text => params[:chef].merge({:email => "guest#{rand(999)}@random.com", :password => 'startupfun', :password_confirmation => 'startupfun'}).inspect

    @chef = Chef.new(params[:chef].merge({:email => "guest#{rand(999)}@random.com", :password => 'startupfun', :password_confirmation => 'startupfun'}))

    respond_to do |format|
      if @chef.save
        format.html { redirect_to(@chef.recipes.last, :notice => 'Recipe and chef successfully created.') }
---
INSERT INTO "chefs" ("name", "encrypted_password", "created_at", "profile", "confirmation_sent_at", "last_sign_in_ip", "updated_at", "last_sign_in_at", "sign_in_count", "profile_img", "password_salt", "tag_line", "website", "reset_password_token", "remember_token", "current_sign_in_ip", "linkedin", "facebook", "confirmation_token", "remember_created_at", "current_sign_in_at", "twitter", "email", "confirmed_at") VALUES(NULL, '483993b5b3af138af1daac245b170a711575714d', '2010-07-26 15:35:36', NULL, NULL, NULL, '2010-07-26 15:35:36', NULL, 0, NULL, 'cpLlxYnnM7SEgVB2cV6K', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 'guest367@random.com', NULL)
SELECT * FROM "recipes" WHERE ("recipes".chef_id = 5) ORDER BY recipes.id DESC LIMIT 1