app/controllers/home_controller.rb

  def index

    @featured = Recipe.with_chefs_recipes.first
---
SELECT "recipes".* FROM "recipes" WHERE ("recipes".chef_id = 1)
SELECT * FROM "chefs" ORDER BY created_at DESC LIMIT 5