app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all
---
SELECT * FROM "recipes"

  def show

    @recipe = Recipe.with_todos_for(user_signed_in? ? current_user : nil).find(params[:id])
---
SELECT "recipes".* FROM "recipes" LEFT OUTER JOIN steps ON recipes.id = steps.recipe_id LEFT OUTER JOIN todos ON todos.step_id = steps.id WHERE ("recipes"."id" = 1) AND ("todos"."user_id" = 41)
SELECT * FROM "todos" WHERE ("todos".step_id = 1) LIMIT 1

  def create
    @recipe = Recipe.new(params[:recipe])

    respond_to do |format|
      if @recipe.save
---
INSERT INTO "recipes" ("name", "chef_id", "steps", "created_at", "updated_at", "ingredients") VALUES('Become a social media marketing guru', NULL, '1. Read: Convergence Culture by Henry Jenkins: http://www.amazon.co.uk/Convergence-Culture-Where-Media-Collide/dp/0814742815

  def edit
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 2)

  def update
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM "recipes" WHERE ("recipes"."id" = 10)