app/controllers/recipes_controller.rb

  def update
    @recipe = Recipe.find(params[:id])

    updated = @recipe.update_attributes!(params[:recipe])

    if updated
      if @recipe.todos.for(current_user).length > 0
---
SELECT * FROM "todos" WHERE ("todos"."id" IN ('1')) AND ("todos".step_id = 6)